In [ ]:
"""
The Employee table holds all employees including their managers. 
Every employee has an Id, and there is also a column for the manager Id.
The manager Id for managers are null.
+----+-------+--------+-----------+
| Id | Name  | Salary | ManagerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
+----+-------+--------+-----------+
Given the Employee table, write a SQL query that finds out employees who earn more than their managers.
"""

In [ ]:
"""testcase"""
{"headers": {"Employee": ["Id", "Name", "Salary", "ManagerId"]}, 
 "rows": {"Employee": [[1, "Joe", 70000, 3], [2, "Henry", 80000, 4], [3, "Sam", 60000, null], [4, "Max", 90000, null]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee(
Id int(4) NOT NULL,
Name varchar(32) NOT NULL,
Salary int(10) NOT NULL,
ManagerId int(4),
PRIMARY KEY ('Id'));

INSERT INTO Employee VALUES
(1, "Joe", 70000, 3),
(2, "Henry", 80000, 4),
(3, "Sam", 60000, null),
(4, "Max", 90000, null);

In [ ]:
"""SQL solution"""
SELECT e.Name AS Employee
FROM Employee AS e, Employee AS m
WHERE e.ManagerId = m.id
AND e.Salary > m.Salary

In [4]:
"""pandas dataframe creation"""
import pandas as pd

emp = [(1, "Joe", 70000, 3),
(2, "Henry", 80000, 4),
(3, "Sam", 60000, 'null'),
(4, "Max", 90000, 'null')]

Employee = pd.DataFrame(emp, columns=['Id', 'Name', 'Salary', 'ManagerId'])
Employee.head()

   Id   Name  Salary ManagerId
0   1    Joe   70000         3
1   2  Henry   80000         4
2   3    Sam   60000      null
3   4    Max   90000      null

In [11]:
df = pd.merge(Employee, Employee, left_on='ManagerId', right_on='Id', suffixes=['_employee', '_manager'])
df[df['Salary_employee'] > df['Salary_manager']]['Name_employee']

0    Joe
Name: Name_employee, dtype: object